Revit 2027 API
Generic.GenericIsMetal Property
 The property labeled "Highlights" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericIsMetal { get; }
Public Shared ReadOnly Property GenericIsMetal As String
	Get
public:
static property String^ GenericIsMetal {
	String^ get ();
}
static member GenericIsMetal : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace